OpenROAD v2.0-25794-g7cbd77e248 
Features included (+) or not (-): +GPU +GUI +Python
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ORD-0030] Using 2 thread(s).
read_liberty /workspaces/vsd-pd/OpenROAD-flow-scripts/flow/platforms/sky130hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_db ./results/sky130hd/vsdbabysoc/base/3_1_place_gp_skip_io.odb
place_pins -hor_layers met3 -ver_layers met2
Found 2 macro blocks.
Using 2 tracks default min distance between IO pins.
[INFO PPL-0001] Number of available slots 7278
[INFO PPL-0002] Number of I/O             7
[INFO PPL-0003] Number of I/O w/sink      7
[INFO PPL-0004] Number of I/O w/o sink    0
[INFO PPL-0005] Slots per section         200
[INFO PPL-0008] Successfully assigned pins to sections.
[INFO PPL-0012] I/O nets HPWL: 1910.10 um.
Elapsed time: 0:01.08[h:]min:sec. CPU time: user 0.87 sys 0.15 (94%). Peak memory: 177820KB.
Log                        Elapsed/s Peak Memory/MB  sha1sum .odb [0:20)
3_2_place_iop                      1            173 3e539bbaecb90e0bd9f8
